OpenROAD e9d88df58cd6e61dec17d0cd7d355f7d6ec25778 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /project/openlane/mgmt_core_wrapper/runs/RUN_2021.12.27_23.52.33/tmp/merged_unpadded.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 443 library cells
[INFO ODB-0226] Finished LEF file:  /project/openlane/mgmt_core_wrapper/runs/RUN_2021.12.27_23.52.33/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /project/openlane/mgmt_core_wrapper/runs/RUN_2021.12.27_23.52.33/results/placement/mgmt_core_wrapper.obs.def
[INFO ODB-0128] Design: mgmt_core_wrapper
[INFO ODB-0130]     Created 742 pins.
[INFO ODB-0131]     Created 2 components and 899 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 4 connections.
[INFO ODB-0133]     Created 827 nets and 895 connections.
[INFO ODB-0134] Finished DEF file: /project/openlane/mgmt_core_wrapper/runs/RUN_2021.12.27_23.52.33/results/placement/mgmt_core_wrapper.obs.def
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met5 and clock max routing layer to met5. 
You're using a GLB_RT_LX_ADJUSTMENT variable in your configuration, which is a deprecated variable that will be removed in the future.
We recommend you update your configuration as follows:
	set ::env(GLB_RT_LAYER_ADJUSTMENTS) 0.99,0.31,0.31,0.21,0.21,0.1
[INFO GRT-0020] Min routing layer: met1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0003] Macros: 2
[INFO GRT-0004] Blockages: 1207
[INFO GRT-0019] Found 0 clock nets.
[WARNING GRT-0036] Pin core_clk is outside die area.
[WARNING GRT-0036] Pin core_rstn is outside die area.
[WARNING GRT-0036] Pin debug_in is outside die area.
[WARNING GRT-0036] Pin debug_mode is outside die area.
[WARNING GRT-0036] Pin debug_oeb is outside die area.
[WARNING GRT-0036] Pin debug_out is outside die area.
[WARNING GRT-0036] Pin flash_clk is outside die area.
[WARNING GRT-0036] Pin flash_csb is outside die area.
[WARNING GRT-0036] Pin flash_io0_di is outside die area.
[WARNING GRT-0036] Pin flash_io0_do is outside die area.
[WARNING GRT-0036] Pin flash_io0_oeb is outside die area.
[WARNING GRT-0036] Pin flash_io1_di is outside die area.
[WARNING GRT-0036] Pin flash_io1_do is outside die area.
[WARNING GRT-0036] Pin flash_io1_oeb is outside die area.
[WARNING GRT-0036] Pin flash_io2_di is outside die area.
[WARNING GRT-0036] Pin flash_io2_do is outside die area.
[WARNING GRT-0036] Pin flash_io2_oeb is outside die area.
[WARNING GRT-0036] Pin flash_io3_di is outside die area.
[WARNING GRT-0036] Pin flash_io3_do is outside die area.
[WARNING GRT-0036] Pin flash_io3_oeb is outside die area.
[WARNING GRT-0036] Pin gpio_in_pad is outside die area.
[WARNING GRT-0036] Pin gpio_inenb_pad is outside die area.
[WARNING GRT-0036] Pin gpio_mode0_pad is outside die area.
[WARNING GRT-0036] Pin gpio_mode1_pad is outside die area.
[WARNING GRT-0036] Pin gpio_out_pad is outside die area.
[WARNING GRT-0036] Pin gpio_outenb_pad is outside die area.
[WARNING GRT-0036] Pin hk_ack_i is outside die area.
[WARNING GRT-0036] Pin hk_cyc_o is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[0] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[10] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[11] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[12] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[13] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[14] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[15] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[16] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[17] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[18] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[19] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[1] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[20] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[21] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[22] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[23] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[24] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[25] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[26] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[27] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[28] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[29] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[2] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[30] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[31] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[3] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[4] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[5] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[6] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[7] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[8] is outside die area.
[WARNING GRT-0036] Pin hk_dat_i[9] is outside die area.
[WARNING GRT-0036] Pin hk_stb_o is outside die area.
[WARNING GRT-0036] Pin irq[0] is outside die area.
[WARNING GRT-0036] Pin irq[1] is outside die area.
[WARNING GRT-0036] Pin irq[2] is outside die area.
[WARNING GRT-0036] Pin irq[3] is outside die area.
[WARNING GRT-0036] Pin irq[4] is outside die area.
[WARNING GRT-0036] Pin irq[5] is outside die area.
[WARNING GRT-0036] Pin la_iena[0] is outside die area.
[WARNING GRT-0036] Pin la_iena[100] is outside die area.
[WARNING GRT-0036] Pin la_iena[101] is outside die area.
[WARNING GRT-0036] Pin la_iena[102] is outside die area.
[WARNING GRT-0036] Pin la_iena[103] is outside die area.
[WARNING GRT-0036] Pin la_iena[104] is outside die area.
[WARNING GRT-0036] Pin la_iena[105] is outside die area.
[WARNING GRT-0036] Pin la_iena[106] is outside die area.
[WARNING GRT-0036] Pin la_iena[107] is outside die area.
[WARNING GRT-0036] Pin la_iena[108] is outside die area.
[WARNING GRT-0036] Pin la_iena[109] is outside die area.
[WARNING GRT-0036] Pin la_iena[10] is outside die area.
[WARNING GRT-0036] Pin la_iena[110] is outside die area.
[WARNING GRT-0036] Pin la_iena[111] is outside die area.
[WARNING GRT-0036] Pin la_iena[112] is outside die area.
[WARNING GRT-0036] Pin la_iena[113] is outside die area.
[WARNING GRT-0036] Pin la_iena[114] is outside die area.
[WARNING GRT-0036] Pin la_iena[115] is outside die area.
[WARNING GRT-0036] Pin la_iena[116] is outside die area.
[WARNING GRT-0036] Pin la_iena[117] is outside die area.
[WARNING GRT-0036] Pin la_iena[118] is outside die area.
[WARNING GRT-0036] Pin la_iena[119] is outside die area.
[WARNING GRT-0036] Pin la_iena[11] is outside die area.
[WARNING GRT-0036] Pin la_iena[120] is outside die area.
[WARNING GRT-0036] Pin la_iena[121] is outside die area.
[WARNING GRT-0036] Pin la_iena[122] is outside die area.
[WARNING GRT-0036] Pin la_iena[123] is outside die area.
[WARNING GRT-0036] Pin la_iena[124] is outside die area.
[WARNING GRT-0036] Pin la_iena[125] is outside die area.
[WARNING GRT-0036] Pin la_iena[126] is outside die area.
[WARNING GRT-0036] Pin la_iena[127] is outside die area.
[WARNING GRT-0036] Pin la_iena[12] is outside die area.
[WARNING GRT-0036] Pin la_iena[13] is outside die area.
[WARNING GRT-0036] Pin la_iena[14] is outside die area.
[WARNING GRT-0036] Pin la_iena[15] is outside die area.
[WARNING GRT-0036] Pin la_iena[16] is outside die area.
[WARNING GRT-0036] Pin la_iena[17] is outside die area.
[WARNING GRT-0036] Pin la_iena[18] is outside die area.
[WARNING GRT-0036] Pin la_iena[19] is outside die area.
[WARNING GRT-0036] Pin la_iena[1] is outside die area.
[WARNING GRT-0036] Pin la_iena[20] is outside die area.
[WARNING GRT-0036] Pin la_iena[21] is outside die area.
[WARNING GRT-0036] Pin la_iena[22] is outside die area.
[WARNING GRT-0036] Pin la_iena[23] is outside die area.
[WARNING GRT-0036] Pin la_iena[24] is outside die area.
[WARNING GRT-0036] Pin la_iena[25] is outside die area.
[WARNING GRT-0036] Pin la_iena[26] is outside die area.
[WARNING GRT-0036] Pin la_iena[27] is outside die area.
[WARNING GRT-0036] Pin la_iena[28] is outside die area.
[WARNING GRT-0036] Pin la_iena[29] is outside die area.
[WARNING GRT-0036] Pin la_iena[2] is outside die area.
[WARNING GRT-0036] Pin la_iena[30] is outside die area.
[WARNING GRT-0036] Pin la_iena[31] is outside die area.
[WARNING GRT-0036] Pin la_iena[32] is outside die area.
[WARNING GRT-0036] Pin la_iena[33] is outside die area.
[WARNING GRT-0036] Pin la_iena[34] is outside die area.
[WARNING GRT-0036] Pin la_iena[35] is outside die area.
[WARNING GRT-0036] Pin la_iena[36] is outside die area.
[WARNING GRT-0036] Pin la_iena[37] is outside die area.
[WARNING GRT-0036] Pin la_iena[38] is outside die area.
[WARNING GRT-0036] Pin la_iena[39] is outside die area.
[WARNING GRT-0036] Pin la_iena[3] is outside die area.
[WARNING GRT-0036] Pin la_iena[40] is outside die area.
[WARNING GRT-0036] Pin la_iena[41] is outside die area.
[WARNING GRT-0036] Pin la_iena[42] is outside die area.
[WARNING GRT-0036] Pin la_iena[43] is outside die area.
[WARNING GRT-0036] Pin la_iena[44] is outside die area.
[WARNING GRT-0036] Pin la_iena[45] is outside die area.
[WARNING GRT-0036] Pin la_iena[46] is outside die area.
[WARNING GRT-0036] Pin la_iena[47] is outside die area.
[WARNING GRT-0036] Pin la_iena[48] is outside die area.
[WARNING GRT-0036] Pin la_iena[49] is outside die area.
[WARNING GRT-0036] Pin la_iena[4] is outside die area.
[WARNING GRT-0036] Pin la_iena[50] is outside die area.
[WARNING GRT-0036] Pin la_iena[51] is outside die area.
[WARNING GRT-0036] Pin la_iena[52] is outside die area.
[WARNING GRT-0036] Pin la_iena[53] is outside die area.
[WARNING GRT-0036] Pin la_iena[54] is outside die area.
[WARNING GRT-0036] Pin la_iena[55] is outside die area.
[WARNING GRT-0036] Pin la_iena[56] is outside die area.
[WARNING GRT-0036] Pin la_iena[57] is outside die area.
[WARNING GRT-0036] Pin la_iena[58] is outside die area.
[WARNING GRT-0036] Pin la_iena[59] is outside die area.
[WARNING GRT-0036] Pin la_iena[5] is outside die area.
[WARNING GRT-0036] Pin la_iena[60] is outside die area.
[WARNING GRT-0036] Pin la_iena[61] is outside die area.
[WARNING GRT-0036] Pin la_iena[62] is outside die area.
[WARNING GRT-0036] Pin la_iena[63] is outside die area.
[WARNING GRT-0036] Pin la_iena[64] is outside die area.
[WARNING GRT-0036] Pin la_iena[65] is outside die area.
[WARNING GRT-0036] Pin la_iena[66] is outside die area.
[WARNING GRT-0036] Pin la_iena[67] is outside die area.
[WARNING GRT-0036] Pin la_iena[68] is outside die area.
[WARNING GRT-0036] Pin la_iena[69] is outside die area.
[WARNING GRT-0036] Pin la_iena[6] is outside die area.
[WARNING GRT-0036] Pin la_iena[70] is outside die area.
[WARNING GRT-0036] Pin la_iena[71] is outside die area.
[WARNING GRT-0036] Pin la_iena[72] is outside die area.
[WARNING GRT-0036] Pin la_iena[73] is outside die area.
[WARNING GRT-0036] Pin la_iena[74] is outside die area.
[WARNING GRT-0036] Pin la_iena[75] is outside die area.
[WARNING GRT-0036] Pin la_iena[76] is outside die area.
[WARNING GRT-0036] Pin la_iena[77] is outside die area.
[WARNING GRT-0036] Pin la_iena[78] is outside die area.
[WARNING GRT-0036] Pin la_iena[79] is outside die area.
[WARNING GRT-0036] Pin la_iena[7] is outside die area.
[WARNING GRT-0036] Pin la_iena[80] is outside die area.
[WARNING GRT-0036] Pin la_iena[81] is outside die area.
[WARNING GRT-0036] Pin la_iena[82] is outside die area.
[WARNING GRT-0036] Pin la_iena[83] is outside die area.
[WARNING GRT-0036] Pin la_iena[84] is outside die area.
[WARNING GRT-0036] Pin la_iena[85] is outside die area.
[WARNING GRT-0036] Pin la_iena[86] is outside die area.
[WARNING GRT-0036] Pin la_iena[87] is outside die area.
[WARNING GRT-0036] Pin la_iena[88] is outside die area.
[WARNING GRT-0036] Pin la_iena[89] is outside die area.
[WARNING GRT-0036] Pin la_iena[8] is outside die area.
[WARNING GRT-0036] Pin la_iena[90] is outside die area.
[WARNING GRT-0036] Pin la_iena[91] is outside die area.
[WARNING GRT-0036] Pin la_iena[92] is outside die area.
[WARNING GRT-0036] Pin la_iena[93] is outside die area.
[WARNING GRT-0036] Pin la_iena[94] is outside die area.
[WARNING GRT-0036] Pin la_iena[95] is outside die area.
[WARNING GRT-0036] Pin la_iena[96] is outside die area.
[WARNING GRT-0036] Pin la_iena[97] is outside die area.
[WARNING GRT-0036] Pin la_iena[98] is outside die area.
[WARNING GRT-0036] Pin la_iena[99] is outside die area.
[WARNING GRT-0036] Pin la_iena[9] is outside die area.
[WARNING GRT-0036] Pin la_input[0] is outside die area.
[WARNING GRT-0036] Pin la_input[100] is outside die area.
[WARNING GRT-0036] Pin la_input[101] is outside die area.
[WARNING GRT-0036] Pin la_input[102] is outside die area.
[WARNING GRT-0036] Pin la_input[103] is outside die area.
[WARNING GRT-0036] Pin la_input[104] is outside die area.
[WARNING GRT-0036] Pin la_input[105] is outside die area.
[WARNING GRT-0036] Pin la_input[106] is outside die area.
[WARNING GRT-0036] Pin la_input[107] is outside die area.
[WARNING GRT-0036] Pin la_input[108] is outside die area.
[WARNING GRT-0036] Pin la_input[109] is outside die area.
[WARNING GRT-0036] Pin la_input[10] is outside die area.
[WARNING GRT-0036] Pin la_input[110] is outside die area.
[WARNING GRT-0036] Pin la_input[111] is outside die area.
[WARNING GRT-0036] Pin la_input[112] is outside die area.
[WARNING GRT-0036] Pin la_input[113] is outside die area.
[WARNING GRT-0036] Pin la_input[114] is outside die area.
[WARNING GRT-0036] Pin la_input[115] is outside die area.
[WARNING GRT-0036] Pin la_input[116] is outside die area.
[WARNING GRT-0036] Pin la_input[117] is outside die area.
[WARNING GRT-0036] Pin la_input[118] is outside die area.
[WARNING GRT-0036] Pin la_input[119] is outside die area.
[WARNING GRT-0036] Pin la_input[11] is outside die area.
[WARNING GRT-0036] Pin la_input[120] is outside die area.
[WARNING GRT-0036] Pin la_input[121] is outside die area.
[WARNING GRT-0036] Pin la_input[122] is outside die area.
[WARNING GRT-0036] Pin la_input[123] is outside die area.
[WARNING GRT-0036] Pin la_input[124] is outside die area.
[WARNING GRT-0036] Pin la_input[125] is outside die area.
[WARNING GRT-0036] Pin la_input[126] is outside die area.
[WARNING GRT-0036] Pin la_input[127] is outside die area.
[WARNING GRT-0036] Pin la_input[12] is outside die area.
[WARNING GRT-0036] Pin la_input[13] is outside die area.
[WARNING GRT-0036] Pin la_input[14] is outside die area.
[WARNING GRT-0036] Pin la_input[15] is outside die area.
[WARNING GRT-0036] Pin la_input[16] is outside die area.
[WARNING GRT-0036] Pin la_input[17] is outside die area.
[WARNING GRT-0036] Pin la_input[18] is outside die area.
[WARNING GRT-0036] Pin la_input[19] is outside die area.
[WARNING GRT-0036] Pin la_input[1] is outside die area.
[WARNING GRT-0036] Pin la_input[20] is outside die area.
[WARNING GRT-0036] Pin la_input[21] is outside die area.
[WARNING GRT-0036] Pin la_input[22] is outside die area.
[WARNING GRT-0036] Pin la_input[23] is outside die area.
[WARNING GRT-0036] Pin la_input[24] is outside die area.
[WARNING GRT-0036] Pin la_input[25] is outside die area.
[WARNING GRT-0036] Pin la_input[26] is outside die area.
[WARNING GRT-0036] Pin la_input[27] is outside die area.
[WARNING GRT-0036] Pin la_input[28] is outside die area.
[WARNING GRT-0036] Pin la_input[29] is outside die area.
[WARNING GRT-0036] Pin la_input[2] is outside die area.
[WARNING GRT-0036] Pin la_input[30] is outside die area.
[WARNING GRT-0036] Pin la_input[31] is outside die area.
[WARNING GRT-0036] Pin la_input[32] is outside die area.
[WARNING GRT-0036] Pin la_input[33] is outside die area.
[WARNING GRT-0036] Pin la_input[34] is outside die area.
[WARNING GRT-0036] Pin la_input[35] is outside die area.
[WARNING GRT-0036] Pin la_input[36] is outside die area.
[WARNING GRT-0036] Pin la_input[37] is outside die area.
[WARNING GRT-0036] Pin la_input[38] is outside die area.
[WARNING GRT-0036] Pin la_input[39] is outside die area.
[WARNING GRT-0036] Pin la_input[3] is outside die area.
[WARNING GRT-0036] Pin la_input[40] is outside die area.
[WARNING GRT-0036] Pin la_input[41] is outside die area.
[WARNING GRT-0036] Pin la_input[42] is outside die area.
[WARNING GRT-0036] Pin la_input[43] is outside die area.
[WARNING GRT-0036] Pin la_input[44] is outside die area.
[WARNING GRT-0036] Pin la_input[45] is outside die area.
[WARNING GRT-0036] Pin la_input[46] is outside die area.
[WARNING GRT-0036] Pin la_input[47] is outside die area.
[WARNING GRT-0036] Pin la_input[48] is outside die area.
[WARNING GRT-0036] Pin la_input[49] is outside die area.
[WARNING GRT-0036] Pin la_input[4] is outside die area.
[WARNING GRT-0036] Pin la_input[50] is outside die area.
[WARNING GRT-0036] Pin la_input[51] is outside die area.
[WARNING GRT-0036] Pin la_input[52] is outside die area.
[WARNING GRT-0036] Pin la_input[53] is outside die area.
[WARNING GRT-0036] Pin la_input[54] is outside die area.
[WARNING GRT-0036] Pin la_input[55] is outside die area.
[WARNING GRT-0036] Pin la_input[56] is outside die area.
[WARNING GRT-0036] Pin la_input[57] is outside die area.
[WARNING GRT-0036] Pin la_input[58] is outside die area.
[WARNING GRT-0036] Pin la_input[59] is outside die area.
[WARNING GRT-0036] Pin la_input[5] is outside die area.
[WARNING GRT-0036] Pin la_input[60] is outside die area.
[WARNING GRT-0036] Pin la_input[61] is outside die area.
[WARNING GRT-0036] Pin la_input[62] is outside die area.
[WARNING GRT-0036] Pin la_input[63] is outside die area.
[WARNING GRT-0036] Pin la_input[64] is outside die area.
[WARNING GRT-0036] Pin la_input[65] is outside die area.
[WARNING GRT-0036] Pin la_input[66] is outside die area.
[WARNING GRT-0036] Pin la_input[67] is outside die area.
[WARNING GRT-0036] Pin la_input[68] is outside die area.
[WARNING GRT-0036] Pin la_input[69] is outside die area.
[WARNING GRT-0036] Pin la_input[6] is outside die area.
[WARNING GRT-0036] Pin la_input[70] is outside die area.
[WARNING GRT-0036] Pin la_input[71] is outside die area.
[WARNING GRT-0036] Pin la_input[72] is outside die area.
[WARNING GRT-0036] Pin la_input[73] is outside die area.
[WARNING GRT-0036] Pin la_input[74] is outside die area.
[WARNING GRT-0036] Pin la_input[75] is outside die area.
[WARNING GRT-0036] Pin la_input[76] is outside die area.
[WARNING GRT-0036] Pin la_input[77] is outside die area.
[WARNING GRT-0036] Pin la_input[78] is outside die area.
[WARNING GRT-0036] Pin la_input[79] is outside die area.
[WARNING GRT-0036] Pin la_input[7] is outside die area.
[WARNING GRT-0036] Pin la_input[80] is outside die area.
[WARNING GRT-0036] Pin la_input[81] is outside die area.
[WARNING GRT-0036] Pin la_input[82] is outside die area.
[WARNING GRT-0036] Pin la_input[83] is outside die area.
[WARNING GRT-0036] Pin la_input[84] is outside die area.
[WARNING GRT-0036] Pin la_input[85] is outside die area.
[WARNING GRT-0036] Pin la_input[86] is outside die area.
[WARNING GRT-0036] Pin la_input[87] is outside die area.
[WARNING GRT-0036] Pin la_input[88] is outside die area.
[WARNING GRT-0036] Pin la_input[89] is outside die area.
[WARNING GRT-0036] Pin la_input[8] is outside die area.
[WARNING GRT-0036] Pin la_input[90] is outside die area.
[WARNING GRT-0036] Pin la_input[91] is outside die area.
[WARNING GRT-0036] Pin la_input[92] is outside die area.
[WARNING GRT-0036] Pin la_input[93] is outside die area.
[WARNING GRT-0036] Pin la_input[94] is outside die area.
[WARNING GRT-0036] Pin la_input[95] is outside die area.
[WARNING GRT-0036] Pin la_input[96] is outside die area.
[WARNING GRT-0036] Pin la_input[97] is outside die area.
[WARNING GRT-0036] Pin la_input[98] is outside die area.
[WARNING GRT-0036] Pin la_input[99] is outside die area.
[WARNING GRT-0036] Pin la_input[9] is outside die area.
[WARNING GRT-0036] Pin la_oenb[0] is outside die area.
[WARNING GRT-0036] Pin la_oenb[100] is outside die area.
[WARNING GRT-0036] Pin la_oenb[101] is outside die area.
[WARNING GRT-0036] Pin la_oenb[102] is outside die area.
[WARNING GRT-0036] Pin la_oenb[103] is outside die area.
[WARNING GRT-0036] Pin la_oenb[104] is outside die area.
[WARNING GRT-0036] Pin la_oenb[105] is outside die area.
[WARNING GRT-0036] Pin la_oenb[106] is outside die area.
[WARNING GRT-0036] Pin la_oenb[107] is outside die area.
[WARNING GRT-0036] Pin la_oenb[108] is outside die area.
[WARNING GRT-0036] Pin la_oenb[109] is outside die area.
[WARNING GRT-0036] Pin la_oenb[10] is outside die area.
[WARNING GRT-0036] Pin la_oenb[110] is outside die area.
[WARNING GRT-0036] Pin la_oenb[111] is outside die area.
[WARNING GRT-0036] Pin la_oenb[112] is outside die area.
[WARNING GRT-0036] Pin la_oenb[113] is outside die area.
[WARNING GRT-0036] Pin la_oenb[114] is outside die area.
[WARNING GRT-0036] Pin la_oenb[115] is outside die area.
[WARNING GRT-0036] Pin la_oenb[116] is outside die area.
[WARNING GRT-0036] Pin la_oenb[117] is outside die area.
[WARNING GRT-0036] Pin la_oenb[118] is outside die area.
[WARNING GRT-0036] Pin la_oenb[119] is outside die area.
[WARNING GRT-0036] Pin la_oenb[11] is outside die area.
[WARNING GRT-0036] Pin la_oenb[120] is outside die area.
[WARNING GRT-0036] Pin la_oenb[121] is outside die area.
[WARNING GRT-0036] Pin la_oenb[122] is outside die area.
[WARNING GRT-0036] Pin la_oenb[123] is outside die area.
[WARNING GRT-0036] Pin la_oenb[124] is outside die area.
[WARNING GRT-0036] Pin la_oenb[125] is outside die area.
[WARNING GRT-0036] Pin la_oenb[126] is outside die area.
[WARNING GRT-0036] Pin la_oenb[127] is outside die area.
[WARNING GRT-0036] Pin la_oenb[12] is outside die area.
[WARNING GRT-0036] Pin la_oenb[13] is outside die area.
[WARNING GRT-0036] Pin la_oenb[14] is outside die area.
[WARNING GRT-0036] Pin la_oenb[15] is outside die area.
[WARNING GRT-0036] Pin la_oenb[16] is outside die area.
[WARNING GRT-0036] Pin la_oenb[17] is outside die area.
[WARNING GRT-0036] Pin la_oenb[18] is outside die area.
[WARNING GRT-0036] Pin la_oenb[19] is outside die area.
[WARNING GRT-0036] Pin la_oenb[1] is outside die area.
[WARNING GRT-0036] Pin la_oenb[20] is outside die area.
[WARNING GRT-0036] Pin la_oenb[21] is outside die area.
[WARNING GRT-0036] Pin la_oenb[22] is outside die area.
[WARNING GRT-0036] Pin la_oenb[23] is outside die area.
[WARNING GRT-0036] Pin la_oenb[24] is outside die area.
[WARNING GRT-0036] Pin la_oenb[25] is outside die area.
[WARNING GRT-0036] Pin la_oenb[26] is outside die area.
[WARNING GRT-0036] Pin la_oenb[27] is outside die area.
[WARNING GRT-0036] Pin la_oenb[28] is outside die area.
[WARNING GRT-0036] Pin la_oenb[29] is outside die area.
[WARNING GRT-0036] Pin la_oenb[2] is outside die area.
[WARNING GRT-0036] Pin la_oenb[30] is outside die area.
[WARNING GRT-0036] Pin la_oenb[31] is outside die area.
[WARNING GRT-0036] Pin la_oenb[32] is outside die area.
[WARNING GRT-0036] Pin la_oenb[33] is outside die area.
[WARNING GRT-0036] Pin la_oenb[34] is outside die area.
[WARNING GRT-0036] Pin la_oenb[35] is outside die area.
[WARNING GRT-0036] Pin la_oenb[36] is outside die area.
[WARNING GRT-0036] Pin la_oenb[37] is outside die area.
[WARNING GRT-0036] Pin la_oenb[38] is outside die area.
[WARNING GRT-0036] Pin la_oenb[39] is outside die area.
[WARNING GRT-0036] Pin la_oenb[3] is outside die area.
[WARNING GRT-0036] Pin la_oenb[40] is outside die area.
[WARNING GRT-0036] Pin la_oenb[41] is outside die area.
[WARNING GRT-0036] Pin la_oenb[42] is outside die area.
[WARNING GRT-0036] Pin la_oenb[43] is outside die area.
[WARNING GRT-0036] Pin la_oenb[44] is outside die area.
[WARNING GRT-0036] Pin la_oenb[45] is outside die area.
[WARNING GRT-0036] Pin la_oenb[46] is outside die area.
[WARNING GRT-0036] Pin la_oenb[47] is outside die area.
[WARNING GRT-0036] Pin la_oenb[48] is outside die area.
[WARNING GRT-0036] Pin la_oenb[49] is outside die area.
[WARNING GRT-0036] Pin la_oenb[4] is outside die area.
[WARNING GRT-0036] Pin la_oenb[50] is outside die area.
[WARNING GRT-0036] Pin la_oenb[51] is outside die area.
[WARNING GRT-0036] Pin la_oenb[52] is outside die area.
[WARNING GRT-0036] Pin la_oenb[53] is outside die area.
[WARNING GRT-0036] Pin la_oenb[54] is outside die area.
[WARNING GRT-0036] Pin la_oenb[55] is outside die area.
[WARNING GRT-0036] Pin la_oenb[56] is outside die area.
[WARNING GRT-0036] Pin la_oenb[57] is outside die area.
[WARNING GRT-0036] Pin la_oenb[58] is outside die area.
[WARNING GRT-0036] Pin la_oenb[59] is outside die area.
[WARNING GRT-0036] Pin la_oenb[5] is outside die area.
[WARNING GRT-0036] Pin la_oenb[60] is outside die area.
[WARNING GRT-0036] Pin la_oenb[61] is outside die area.
[WARNING GRT-0036] Pin la_oenb[62] is outside die area.
[WARNING GRT-0036] Pin la_oenb[63] is outside die area.
[WARNING GRT-0036] Pin la_oenb[64] is outside die area.
[WARNING GRT-0036] Pin la_oenb[65] is outside die area.
[WARNING GRT-0036] Pin la_oenb[66] is outside die area.
[WARNING GRT-0036] Pin la_oenb[67] is outside die area.
[WARNING GRT-0036] Pin la_oenb[68] is outside die area.
[WARNING GRT-0036] Pin la_oenb[69] is outside die area.
[WARNING GRT-0036] Pin la_oenb[6] is outside die area.
[WARNING GRT-0036] Pin la_oenb[70] is outside die area.
[WARNING GRT-0036] Pin la_oenb[71] is outside die area.
[WARNING GRT-0036] Pin la_oenb[72] is outside die area.
[WARNING GRT-0036] Pin la_oenb[73] is outside die area.
[WARNING GRT-0036] Pin la_oenb[74] is outside die area.
[WARNING GRT-0036] Pin la_oenb[75] is outside die area.
[WARNING GRT-0036] Pin la_oenb[76] is outside die area.
[WARNING GRT-0036] Pin la_oenb[77] is outside die area.
[WARNING GRT-0036] Pin la_oenb[78] is outside die area.
[WARNING GRT-0036] Pin la_oenb[79] is outside die area.
[WARNING GRT-0036] Pin la_oenb[7] is outside die area.
[WARNING GRT-0036] Pin la_oenb[80] is outside die area.
[WARNING GRT-0036] Pin la_oenb[81] is outside die area.
[WARNING GRT-0036] Pin la_oenb[82] is outside die area.
[WARNING GRT-0036] Pin la_oenb[83] is outside die area.
[WARNING GRT-0036] Pin la_oenb[84] is outside die area.
[WARNING GRT-0036] Pin la_oenb[85] is outside die area.
[WARNING GRT-0036] Pin la_oenb[86] is outside die area.
[WARNING GRT-0036] Pin la_oenb[87] is outside die area.
[WARNING GRT-0036] Pin la_oenb[88] is outside die area.
[WARNING GRT-0036] Pin la_oenb[89] is outside die area.
[WARNING GRT-0036] Pin la_oenb[8] is outside die area.
[WARNING GRT-0036] Pin la_oenb[90] is outside die area.
[WARNING GRT-0036] Pin la_oenb[91] is outside die area.
[WARNING GRT-0036] Pin la_oenb[92] is outside die area.
[WARNING GRT-0036] Pin la_oenb[93] is outside die area.
[WARNING GRT-0036] Pin la_oenb[94] is outside die area.
[WARNING GRT-0036] Pin la_oenb[95] is outside die area.
[WARNING GRT-0036] Pin la_oenb[96] is outside die area.
[WARNING GRT-0036] Pin la_oenb[97] is outside die area.
[WARNING GRT-0036] Pin la_oenb[98] is outside die area.
[WARNING GRT-0036] Pin la_oenb[99] is outside die area.
[WARNING GRT-0036] Pin la_oenb[9] is outside die area.
[WARNING GRT-0036] Pin la_output[0] is outside die area.
[WARNING GRT-0036] Pin la_output[100] is outside die area.
[WARNING GRT-0036] Pin la_output[101] is outside die area.
[WARNING GRT-0036] Pin la_output[102] is outside die area.
[WARNING GRT-0036] Pin la_output[103] is outside die area.
[WARNING GRT-0036] Pin la_output[104] is outside die area.
[WARNING GRT-0036] Pin la_output[105] is outside die area.
[WARNING GRT-0036] Pin la_output[106] is outside die area.
[WARNING GRT-0036] Pin la_output[107] is outside die area.
[WARNING GRT-0036] Pin la_output[108] is outside die area.
[WARNING GRT-0036] Pin la_output[109] is outside die area.
[WARNING GRT-0036] Pin la_output[10] is outside die area.
[WARNING GRT-0036] Pin la_output[110] is outside die area.
[WARNING GRT-0036] Pin la_output[111] is outside die area.
[WARNING GRT-0036] Pin la_output[112] is outside die area.
[WARNING GRT-0036] Pin la_output[113] is outside die area.
[WARNING GRT-0036] Pin la_output[114] is outside die area.
[WARNING GRT-0036] Pin la_output[115] is outside die area.
[WARNING GRT-0036] Pin la_output[116] is outside die area.
[WARNING GRT-0036] Pin la_output[117] is outside die area.
[WARNING GRT-0036] Pin la_output[118] is outside die area.
[WARNING GRT-0036] Pin la_output[119] is outside die area.
[WARNING GRT-0036] Pin la_output[11] is outside die area.
[WARNING GRT-0036] Pin la_output[120] is outside die area.
[WARNING GRT-0036] Pin la_output[121] is outside die area.
[WARNING GRT-0036] Pin la_output[122] is outside die area.
[WARNING GRT-0036] Pin la_output[123] is outside die area.
[WARNING GRT-0036] Pin la_output[124] is outside die area.
[WARNING GRT-0036] Pin la_output[125] is outside die area.
[WARNING GRT-0036] Pin la_output[126] is outside die area.
[WARNING GRT-0036] Pin la_output[127] is outside die area.
[WARNING GRT-0036] Pin la_output[12] is outside die area.
[WARNING GRT-0036] Pin la_output[13] is outside die area.
[WARNING GRT-0036] Pin la_output[14] is outside die area.
[WARNING GRT-0036] Pin la_output[15] is outside die area.
[WARNING GRT-0036] Pin la_output[16] is outside die area.
[WARNING GRT-0036] Pin la_output[17] is outside die area.
[WARNING GRT-0036] Pin la_output[18] is outside die area.
[WARNING GRT-0036] Pin la_output[19] is outside die area.
[WARNING GRT-0036] Pin la_output[1] is outside die area.
[WARNING GRT-0036] Pin la_output[20] is outside die area.
[WARNING GRT-0036] Pin la_output[21] is outside die area.
[WARNING GRT-0036] Pin la_output[22] is outside die area.
[WARNING GRT-0036] Pin la_output[23] is outside die area.
[WARNING GRT-0036] Pin la_output[24] is outside die area.
[WARNING GRT-0036] Pin la_output[25] is outside die area.
[WARNING GRT-0036] Pin la_output[26] is outside die area.
[WARNING GRT-0036] Pin la_output[27] is outside die area.
[WARNING GRT-0036] Pin la_output[28] is outside die area.
[WARNING GRT-0036] Pin la_output[29] is outside die area.
[WARNING GRT-0036] Pin la_output[2] is outside die area.
[WARNING GRT-0036] Pin la_output[30] is outside die area.
[WARNING GRT-0036] Pin la_output[31] is outside die area.
[WARNING GRT-0036] Pin la_output[32] is outside die area.
[WARNING GRT-0036] Pin la_output[33] is outside die area.
[WARNING GRT-0036] Pin la_output[34] is outside die area.
[WARNING GRT-0036] Pin la_output[35] is outside die area.
[WARNING GRT-0036] Pin la_output[36] is outside die area.
[WARNING GRT-0036] Pin la_output[37] is outside die area.
[WARNING GRT-0036] Pin la_output[38] is outside die area.
[WARNING GRT-0036] Pin la_output[39] is outside die area.
[WARNING GRT-0036] Pin la_output[3] is outside die area.
[WARNING GRT-0036] Pin la_output[40] is outside die area.
[WARNING GRT-0036] Pin la_output[41] is outside die area.
[WARNING GRT-0036] Pin la_output[42] is outside die area.
[WARNING GRT-0036] Pin la_output[43] is outside die area.
[WARNING GRT-0036] Pin la_output[44] is outside die area.
[WARNING GRT-0036] Pin la_output[45] is outside die area.
[WARNING GRT-0036] Pin la_output[46] is outside die area.
[WARNING GRT-0036] Pin la_output[47] is outside die area.
[WARNING GRT-0036] Pin la_output[48] is outside die area.
[WARNING GRT-0036] Pin la_output[49] is outside die area.
[WARNING GRT-0036] Pin la_output[4] is outside die area.
[WARNING GRT-0036] Pin la_output[50] is outside die area.
[WARNING GRT-0036] Pin la_output[51] is outside die area.
[WARNING GRT-0036] Pin la_output[52] is outside die area.
[WARNING GRT-0036] Pin la_output[53] is outside die area.
[WARNING GRT-0036] Pin la_output[54] is outside die area.
[WARNING GRT-0036] Pin la_output[55] is outside die area.
[WARNING GRT-0036] Pin la_output[56] is outside die area.
[WARNING GRT-0036] Pin la_output[57] is outside die area.
[WARNING GRT-0036] Pin la_output[58] is outside die area.
[WARNING GRT-0036] Pin la_output[59] is outside die area.
[WARNING GRT-0036] Pin la_output[5] is outside die area.
[WARNING GRT-0036] Pin la_output[60] is outside die area.
[WARNING GRT-0036] Pin la_output[61] is outside die area.
[WARNING GRT-0036] Pin la_output[62] is outside die area.
[WARNING GRT-0036] Pin la_output[63] is outside die area.
[WARNING GRT-0036] Pin la_output[64] is outside die area.
[WARNING GRT-0036] Pin la_output[65] is outside die area.
[WARNING GRT-0036] Pin la_output[66] is outside die area.
[WARNING GRT-0036] Pin la_output[67] is outside die area.
[WARNING GRT-0036] Pin la_output[68] is outside die area.
[WARNING GRT-0036] Pin la_output[69] is outside die area.
[WARNING GRT-0036] Pin la_output[6] is outside die area.
[WARNING GRT-0036] Pin la_output[70] is outside die area.
[WARNING GRT-0036] Pin la_output[71] is outside die area.
[WARNING GRT-0036] Pin la_output[72] is outside die area.
[WARNING GRT-0036] Pin la_output[73] is outside die area.
[WARNING GRT-0036] Pin la_output[74] is outside die area.
[WARNING GRT-0036] Pin la_output[75] is outside die area.
[WARNING GRT-0036] Pin la_output[76] is outside die area.
[WARNING GRT-0036] Pin la_output[77] is outside die area.
[WARNING GRT-0036] Pin la_output[78] is outside die area.
[WARNING GRT-0036] Pin la_output[79] is outside die area.
[WARNING GRT-0036] Pin la_output[7] is outside die area.
[WARNING GRT-0036] Pin la_output[80] is outside die area.
[WARNING GRT-0036] Pin la_output[81] is outside die area.
[WARNING GRT-0036] Pin la_output[82] is outside die area.
[WARNING GRT-0036] Pin la_output[83] is outside die area.
[WARNING GRT-0036] Pin la_output[84] is outside die area.
[WARNING GRT-0036] Pin la_output[85] is outside die area.
[WARNING GRT-0036] Pin la_output[86] is outside die area.
[WARNING GRT-0036] Pin la_output[87] is outside die area.
[WARNING GRT-0036] Pin la_output[88] is outside die area.
[WARNING GRT-0036] Pin la_output[89] is outside die area.
[WARNING GRT-0036] Pin la_output[8] is outside die area.
[WARNING GRT-0036] Pin la_output[90] is outside die area.
[WARNING GRT-0036] Pin la_output[91] is outside die area.
[WARNING GRT-0036] Pin la_output[92] is outside die area.
[WARNING GRT-0036] Pin la_output[93] is outside die area.
[WARNING GRT-0036] Pin la_output[94] is outside die area.
[WARNING GRT-0036] Pin la_output[95] is outside die area.
[WARNING GRT-0036] Pin la_output[96] is outside die area.
[WARNING GRT-0036] Pin la_output[97] is outside die area.
[WARNING GRT-0036] Pin la_output[98] is outside die area.
[WARNING GRT-0036] Pin la_output[99] is outside die area.
[WARNING GRT-0036] Pin la_output[9] is outside die area.
[WARNING GRT-0036] Pin mprj_ack_i is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[0] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[10] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[11] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[12] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[13] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[14] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[15] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[16] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[17] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[18] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[19] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[1] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[20] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[21] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[22] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[23] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[24] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[25] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[26] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[27] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[28] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[29] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[2] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[30] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[31] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[3] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[4] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[5] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[6] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[7] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[8] is outside die area.
[WARNING GRT-0036] Pin mprj_adr_o[9] is outside die area.
[WARNING GRT-0036] Pin mprj_cyc_o is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[0] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[10] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[11] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[12] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[13] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[14] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[15] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[16] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[17] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[18] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[19] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[1] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[20] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[21] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[22] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[23] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[24] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[25] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[26] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[27] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[28] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[29] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[2] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[30] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[31] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[3] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[4] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[5] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[6] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[7] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[8] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_i[9] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[0] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[10] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[11] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[12] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[13] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[14] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[15] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[16] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[17] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[18] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[19] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[1] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[20] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[21] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[22] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[23] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[24] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[25] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[26] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[27] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[28] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[29] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[2] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[30] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[31] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[3] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[4] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[5] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[6] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[7] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[8] is outside die area.
[WARNING GRT-0036] Pin mprj_dat_o[9] is outside die area.
[WARNING GRT-0036] Pin mprj_sel_o[0] is outside die area.
[WARNING GRT-0036] Pin mprj_sel_o[1] is outside die area.
[WARNING GRT-0036] Pin mprj_sel_o[2] is outside die area.
[WARNING GRT-0036] Pin mprj_sel_o[3] is outside die area.
[WARNING GRT-0036] Pin mprj_stb_o is outside die area.
[WARNING GRT-0036] Pin mprj_wb_iena is outside die area.
[WARNING GRT-0036] Pin mprj_we_o is outside die area.
[WARNING GRT-0036] Pin qspi_enabled is outside die area.
[WARNING GRT-0036] Pin ser_rx is outside die area.
[WARNING GRT-0036] Pin ser_tx is outside die area.
[WARNING GRT-0036] Pin spi_csb is outside die area.
[WARNING GRT-0036] Pin spi_enabled is outside die area.
[WARNING GRT-0036] Pin spi_sck is outside die area.
[WARNING GRT-0036] Pin spi_sdi is outside die area.
[WARNING GRT-0036] Pin spi_sdo is outside die area.
[WARNING GRT-0036] Pin spi_sdoenb is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[0] is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[1] is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[2] is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[3] is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[4] is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[5] is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[6] is outside die area.
[WARNING GRT-0036] Pin sram_ro_addr[7] is outside die area.
[WARNING GRT-0036] Pin sram_ro_clk is outside die area.
[WARNING GRT-0036] Pin sram_ro_csb is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[0] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[10] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[11] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[12] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[13] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[14] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[15] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[16] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[17] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[18] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[19] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[1] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[20] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[21] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[22] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[23] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[24] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[25] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[26] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[27] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[28] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[29] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[2] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[30] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[31] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[3] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[4] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[5] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[6] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[7] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[8] is outside die area.
[WARNING GRT-0036] Pin sram_ro_data[9] is outside die area.
[WARNING GRT-0036] Pin trap is outside die area.
[WARNING GRT-0036] Pin uart_enabled is outside die area.
[WARNING GRT-0036] Pin user_irq_ena[0] is outside die area.
[WARNING GRT-0036] Pin user_irq_ena[1] is outside die area.
[WARNING GRT-0036] Pin user_irq_ena[2] is outside die area.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 3
[INFO GRT-0017] Processing 2 blockages on layer met1.
[INFO GRT-0017] Processing 1395 blockages on layer met2.
[INFO GRT-0017] Processing 580 blockages on layer met3.
[INFO GRT-0017] Processing 237 blockages on layer met4.
[INFO GRT-0017] Processing 75 blockages on layer met5.

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical            0             0          0.00%
met1       Horizontal     894440        122795          86.27%
met2       Vertical       670830         77319          88.47%
met3       Horizontal     447220         59992          86.59%
met4       Vertical       268332         61800          76.97%
met5       Horizontal      89444         35436          60.38%
---------------------------------------------------------------

[INFO GRT-0191] Wirelength: 34615, Wirelength1: 0
[INFO GRT-0192] Number of segments: 808
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0097] First L Route.
[INFO GRT-0191] Wirelength: 34615, Wirelength1: 34615
[INFO GRT-0192] Number of segments: 808
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 218223
[INFO GRT-0137] Total vCap               : 139119
[INFO GRT-0138] Total usage              : 34615
[INFO GRT-0139] Max H overflow           : 39
[INFO GRT-0140] Max V overflow           : 9
[INFO GRT-0141] Max overflow             : 39
[INFO GRT-0142] Number of overflow edges : 2315
[INFO GRT-0143] H   overflow             : 8970
[INFO GRT-0144] V   overflow             : 730
[INFO GRT-0145] Final overflow           : 9700

[INFO GRT-0098] Second L Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 218223
[INFO GRT-0137] Total vCap               : 139119
[INFO GRT-0138] Total usage              : 34615
[INFO GRT-0139] Max H overflow           : 39
[INFO GRT-0140] Max V overflow           : 9
[INFO GRT-0141] Max overflow             : 39
[INFO GRT-0142] Number of overflow edges : 2315
[INFO GRT-0143] H   overflow             : 8970
[INFO GRT-0144] V   overflow             : 730
[INFO GRT-0145] Final overflow           : 9700

[INFO GRT-0099] First Z Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 218223
[INFO GRT-0137] Total vCap               : 139119
[INFO GRT-0138] Total usage              : 34615
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 6
[INFO GRT-0141] Max overflow             : 6
[INFO GRT-0142] Number of overflow edges : 15
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 40
[INFO GRT-0145] Final overflow           : 40

[INFO GRT-0100] LV routing round 0, enlarge 10.
[INFO GRT-0182] 10 threshold, 10 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 34615
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0100] LV routing round 1, enlarge 15.
[INFO GRT-0182] 5 threshold, 15 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 34615
[INFO GRT-0128] Max H overflow       : 1
[INFO GRT-0129] Max V overflow       : 10
[INFO GRT-0130] Max overflow         : 10
[INFO GRT-0131] Number overflow edges: 16
[INFO GRT-0132] H   overflow         : 1
[INFO GRT-0133] V   overflow         : 83
[INFO GRT-0134] Final overflow       : 84

[INFO GRT-0100] LV routing round 2, enlarge 20.
[INFO GRT-0182] 1 threshold, 20 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 34615
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

Usage checked
[INFO GRT-0105] Maze routing finished.
Final 2D results:
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 34615
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0106] Layer assignment begins.
[INFO GRT-0107] Layer assignment finished.
[INFO GRT-0108] Post-processing begins.
[INFO GRT-0109] Post-processing finished.
 Starting via filling.
[INFO GRT-0197] Via related to pin nodes: 2600
[INFO GRT-0198] Via related Steiner nodes: 0
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 3905
[INFO GRT-0112] Final usage 3D: 46330

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                  0             0            0.00%             0 /  0 /  0
met1            122795         26397           21.50%             0 /  0 /  0
met2             77319          5351            6.92%             0 /  0 /  0
met3             59992          2842            4.74%             0 /  0 /  0
met4             61800            25            0.04%             0 /  0 /  0
met5             35436             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total           357342         34615            9.69%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 284231 um
[INFO GRT-0014] Routed nets: 807
###############################################################################
# Created by write_sdc
# Mon Dec 27 23:52:36 2021
###############################################################################
current_design mgmt_core_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clk -period 25.0000 [get_ports {core_clk}]
set_clock_transition 0.1500 [get_clocks {core_clk}]
set_clock_uncertainty 0.2500 core_clk
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {core_rstn}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_in}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io0_di}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io1_di}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io2_di}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io3_di}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_in_pad}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_ack_i}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[0]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[10]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[11]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[12]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[13]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[14]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[15]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[16]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[17]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[18]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[19]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[1]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[20]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[21]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[22]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[23]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[24]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[25]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[26]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[27]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[28]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[29]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[2]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[30]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[31]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[3]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[4]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[5]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[6]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[7]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[8]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[9]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[0]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[1]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[2]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[3]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[4]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[5]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[0]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[100]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[101]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[102]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[103]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[104]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[105]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[106]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[107]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[108]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[109]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[10]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[110]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[111]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[112]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[113]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[114]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[115]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[116]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[117]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[118]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[119]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[11]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[120]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[121]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[122]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[123]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[124]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[125]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[126]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[127]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[12]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[13]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[14]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[15]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[16]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[17]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[18]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[19]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[1]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[20]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[21]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[22]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[23]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[24]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[25]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[26]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[27]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[28]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[29]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[2]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[30]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[31]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[32]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[33]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[34]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[35]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[36]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[37]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[38]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[39]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[3]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[40]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[41]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[42]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[43]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[44]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[45]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[46]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[47]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[48]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[49]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[4]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[50]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[51]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[52]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[53]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[54]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[55]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[56]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[57]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[58]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[59]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[5]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[60]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[61]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[62]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[63]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[64]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[65]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[66]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[67]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[68]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[69]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[6]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[70]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[71]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[72]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[73]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[74]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[75]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[76]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[77]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[78]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[79]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[7]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[80]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[81]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[82]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[83]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[84]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[85]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[86]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[87]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[88]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[89]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[8]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[90]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[91]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[92]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[93]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[94]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[95]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[96]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[97]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[98]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[99]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[9]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_ack_i}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[0]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[10]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[11]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[12]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[13]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[14]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[15]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[16]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[17]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[18]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[19]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[1]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[20]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[21]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[22]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[23]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[24]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[25]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[26]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[27]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[28]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[29]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[2]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[30]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[31]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[3]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[4]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[5]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[6]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[7]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[8]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[9]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {ser_rx}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sdi}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[0]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[1]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[2]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[3]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[4]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[5]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[6]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_addr[7]}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_clk}]
set_input_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_csb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_mode}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_oeb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_out}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_clk}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_csb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io0_do}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io0_oeb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io1_do}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io1_oeb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io2_do}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io2_oeb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io3_do}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io3_oeb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_inenb_pad}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_mode0_pad}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_mode1_pad}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_out_pad}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_outenb_pad}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_cyc_o}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_stb_o}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[100]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[101]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[102]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[103]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[104]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[105]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[106]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[107]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[108]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[109]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[10]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[110]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[111]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[112]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[113]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[114]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[115]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[116]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[117]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[118]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[119]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[11]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[120]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[121]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[122]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[123]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[124]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[125]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[126]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[127]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[12]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[13]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[14]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[15]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[16]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[17]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[18]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[19]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[20]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[21]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[22]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[23]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[24]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[25]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[26]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[27]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[28]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[29]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[2]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[30]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[31]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[32]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[33]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[34]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[35]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[36]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[37]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[38]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[39]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[3]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[40]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[41]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[42]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[43]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[44]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[45]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[46]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[47]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[48]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[49]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[4]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[50]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[51]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[52]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[53]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[54]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[55]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[56]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[57]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[58]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[59]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[5]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[60]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[61]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[62]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[63]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[64]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[65]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[66]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[67]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[68]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[69]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[6]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[70]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[71]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[72]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[73]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[74]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[75]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[76]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[77]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[78]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[79]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[7]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[80]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[81]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[82]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[83]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[84]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[85]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[86]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[87]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[88]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[89]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[8]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[90]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[91]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[92]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[93]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[94]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[95]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[96]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[97]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[98]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[99]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[9]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[100]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[101]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[102]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[103]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[104]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[105]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[106]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[107]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[108]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[109]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[10]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[110]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[111]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[112]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[113]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[114]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[115]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[116]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[117]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[118]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[119]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[11]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[120]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[121]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[122]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[123]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[124]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[125]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[126]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[127]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[12]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[13]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[14]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[15]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[16]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[17]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[18]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[19]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[20]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[21]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[22]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[23]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[24]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[25]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[26]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[27]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[28]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[29]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[2]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[30]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[31]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[32]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[33]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[34]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[35]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[36]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[37]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[38]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[39]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[3]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[40]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[41]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[42]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[43]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[44]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[45]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[46]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[47]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[48]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[49]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[4]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[50]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[51]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[52]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[53]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[54]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[55]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[56]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[57]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[58]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[59]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[5]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[60]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[61]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[62]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[63]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[64]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[65]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[66]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[67]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[68]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[69]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[6]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[70]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[71]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[72]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[73]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[74]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[75]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[76]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[77]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[78]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[79]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[7]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[80]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[81]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[82]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[83]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[84]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[85]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[86]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[87]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[88]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[89]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[8]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[90]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[91]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[92]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[93]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[94]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[95]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[96]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[97]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[98]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[99]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[9]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[100]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[101]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[102]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[103]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[104]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[105]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[106]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[107]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[108]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[109]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[10]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[110]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[111]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[112]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[113]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[114]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[115]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[116]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[117]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[118]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[119]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[11]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[120]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[121]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[122]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[123]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[124]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[125]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[126]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[127]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[12]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[13]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[14]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[15]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[16]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[17]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[18]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[19]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[20]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[21]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[22]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[23]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[24]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[25]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[26]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[27]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[28]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[29]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[2]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[30]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[31]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[32]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[33]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[34]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[35]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[36]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[37]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[38]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[39]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[3]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[40]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[41]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[42]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[43]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[44]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[45]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[46]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[47]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[48]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[49]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[4]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[50]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[51]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[52]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[53]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[54]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[55]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[56]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[57]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[58]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[59]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[5]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[60]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[61]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[62]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[63]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[64]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[65]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[66]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[67]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[68]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[69]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[6]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[70]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[71]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[72]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[73]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[74]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[75]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[76]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[77]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[78]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[79]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[7]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[80]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[81]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[82]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[83]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[84]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[85]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[86]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[87]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[88]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[89]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[8]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[90]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[91]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[92]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[93]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[94]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[95]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[96]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[97]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[98]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[99]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[9]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[10]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[11]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[12]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[13]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[14]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[15]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[16]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[17]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[18]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[19]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[20]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[21]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[22]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[23]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[24]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[25]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[26]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[27]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[28]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[29]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[2]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[30]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[31]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[3]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[4]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[5]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[6]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[7]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[8]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[9]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_cyc_o}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[10]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[11]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[12]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[13]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[14]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[15]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[16]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[17]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[18]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[19]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[20]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[21]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[22]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[23]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[24]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[25]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[26]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[27]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[28]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[29]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[2]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[30]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[31]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[3]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[4]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[5]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[6]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[7]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[8]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[9]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[2]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[3]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_stb_o}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_wb_iena}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_we_o}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {qspi_enabled}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {ser_tx}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_csb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_enabled}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sck}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sdo}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sdoenb}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[10]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[11]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[12]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[13]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[14]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[15]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[16]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[17]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[18]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[19]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[20]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[21]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[22]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[23]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[24]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[25]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[26]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[27]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[28]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[29]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[2]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[30]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[31]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[3]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[4]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[5]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[6]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[7]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[8]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {sram_ro_data[9]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {trap}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {uart_enabled}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {user_irq_ena[0]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {user_irq_ena[1]}]
set_output_delay 5.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {user_irq_ena[2]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {debug_mode}]
set_load -pin_load 0.0334 [get_ports {debug_oeb}]
set_load -pin_load 0.0334 [get_ports {debug_out}]
set_load -pin_load 0.0334 [get_ports {flash_clk}]
set_load -pin_load 0.0334 [get_ports {flash_csb}]
set_load -pin_load 0.0334 [get_ports {flash_io0_do}]
set_load -pin_load 0.0334 [get_ports {flash_io0_oeb}]
set_load -pin_load 0.0334 [get_ports {flash_io1_do}]
set_load -pin_load 0.0334 [get_ports {flash_io1_oeb}]
set_load -pin_load 0.0334 [get_ports {flash_io2_do}]
set_load -pin_load 0.0334 [get_ports {flash_io2_oeb}]
set_load -pin_load 0.0334 [get_ports {flash_io3_do}]
set_load -pin_load 0.0334 [get_ports {flash_io3_oeb}]
set_load -pin_load 0.0334 [get_ports {gpio_inenb_pad}]
set_load -pin_load 0.0334 [get_ports {gpio_mode0_pad}]
set_load -pin_load 0.0334 [get_ports {gpio_mode1_pad}]
set_load -pin_load 0.0334 [get_ports {gpio_out_pad}]
set_load -pin_load 0.0334 [get_ports {gpio_outenb_pad}]
set_load -pin_load 0.0334 [get_ports {hk_cyc_o}]
set_load -pin_load 0.0334 [get_ports {hk_stb_o}]
set_load -pin_load 0.0334 [get_ports {mprj_cyc_o}]
set_load -pin_load 0.0334 [get_ports {mprj_stb_o}]
set_load -pin_load 0.0334 [get_ports {mprj_wb_iena}]
set_load -pin_load 0.0334 [get_ports {mprj_we_o}]
set_load -pin_load 0.0334 [get_ports {qspi_enabled}]
set_load -pin_load 0.0334 [get_ports {ser_tx}]
set_load -pin_load 0.0334 [get_ports {spi_csb}]
set_load -pin_load 0.0334 [get_ports {spi_enabled}]
set_load -pin_load 0.0334 [get_ports {spi_sck}]
set_load -pin_load 0.0334 [get_ports {spi_sdo}]
set_load -pin_load 0.0334 [get_ports {spi_sdoenb}]
set_load -pin_load 0.0334 [get_ports {trap}]
set_load -pin_load 0.0334 [get_ports {uart_enabled}]
set_load -pin_load 0.0334 [get_ports {la_iena[127]}]
set_load -pin_load 0.0334 [get_ports {la_iena[126]}]
set_load -pin_load 0.0334 [get_ports {la_iena[125]}]
set_load -pin_load 0.0334 [get_ports {la_iena[124]}]
set_load -pin_load 0.0334 [get_ports {la_iena[123]}]
set_load -pin_load 0.0334 [get_ports {la_iena[122]}]
set_load -pin_load 0.0334 [get_ports {la_iena[121]}]
set_load -pin_load 0.0334 [get_ports {la_iena[120]}]
set_load -pin_load 0.0334 [get_ports {la_iena[119]}]
set_load -pin_load 0.0334 [get_ports {la_iena[118]}]
set_load -pin_load 0.0334 [get_ports {la_iena[117]}]
set_load -pin_load 0.0334 [get_ports {la_iena[116]}]
set_load -pin_load 0.0334 [get_ports {la_iena[115]}]
set_load -pin_load 0.0334 [get_ports {la_iena[114]}]
set_load -pin_load 0.0334 [get_ports {la_iena[113]}]
set_load -pin_load 0.0334 [get_ports {la_iena[112]}]
set_load -pin_load 0.0334 [get_ports {la_iena[111]}]
set_load -pin_load 0.0334 [get_ports {la_iena[110]}]
set_load -pin_load 0.0334 [get_ports {la_iena[109]}]
set_load -pin_load 0.0334 [get_ports {la_iena[108]}]
set_load -pin_load 0.0334 [get_ports {la_iena[107]}]
set_load -pin_load 0.0334 [get_ports {la_iena[106]}]
set_load -pin_load 0.0334 [get_ports {la_iena[105]}]
set_load -pin_load 0.0334 [get_ports {la_iena[104]}]
set_load -pin_load 0.0334 [get_ports {la_iena[103]}]
set_load -pin_load 0.0334 [get_ports {la_iena[102]}]
set_load -pin_load 0.0334 [get_ports {la_iena[101]}]
set_load -pin_load 0.0334 [get_ports {la_iena[100]}]
set_load -pin_load 0.0334 [get_ports {la_iena[99]}]
set_load -pin_load 0.0334 [get_ports {la_iena[98]}]
set_load -pin_load 0.0334 [get_ports {la_iena[97]}]
set_load -pin_load 0.0334 [get_ports {la_iena[96]}]
set_load -pin_load 0.0334 [get_ports {la_iena[95]}]
set_load -pin_load 0.0334 [get_ports {la_iena[94]}]
set_load -pin_load 0.0334 [get_ports {la_iena[93]}]
set_load -pin_load 0.0334 [get_ports {la_iena[92]}]
set_load -pin_load 0.0334 [get_ports {la_iena[91]}]
set_load -pin_load 0.0334 [get_ports {la_iena[90]}]
set_load -pin_load 0.0334 [get_ports {la_iena[89]}]
set_load -pin_load 0.0334 [get_ports {la_iena[88]}]
set_load -pin_load 0.0334 [get_ports {la_iena[87]}]
set_load -pin_load 0.0334 [get_ports {la_iena[86]}]
set_load -pin_load 0.0334 [get_ports {la_iena[85]}]
set_load -pin_load 0.0334 [get_ports {la_iena[84]}]
set_load -pin_load 0.0334 [get_ports {la_iena[83]}]
set_load -pin_load 0.0334 [get_ports {la_iena[82]}]
set_load -pin_load 0.0334 [get_ports {la_iena[81]}]
set_load -pin_load 0.0334 [get_ports {la_iena[80]}]
set_load -pin_load 0.0334 [get_ports {la_iena[79]}]
set_load -pin_load 0.0334 [get_ports {la_iena[78]}]
set_load -pin_load 0.0334 [get_ports {la_iena[77]}]
set_load -pin_load 0.0334 [get_ports {la_iena[76]}]
set_load -pin_load 0.0334 [get_ports {la_iena[75]}]
set_load -pin_load 0.0334 [get_ports {la_iena[74]}]
set_load -pin_load 0.0334 [get_ports {la_iena[73]}]
set_load -pin_load 0.0334 [get_ports {la_iena[72]}]
set_load -pin_load 0.0334 [get_ports {la_iena[71]}]
set_load -pin_load 0.0334 [get_ports {la_iena[70]}]
set_load -pin_load 0.0334 [get_ports {la_iena[69]}]
set_load -pin_load 0.0334 [get_ports {la_iena[68]}]
set_load -pin_load 0.0334 [get_ports {la_iena[67]}]
set_load -pin_load 0.0334 [get_ports {la_iena[66]}]
set_load -pin_load 0.0334 [get_ports {la_iena[65]}]
set_load -pin_load 0.0334 [get_ports {la_iena[64]}]
set_load -pin_load 0.0334 [get_ports {la_iena[63]}]
set_load -pin_load 0.0334 [get_ports {la_iena[62]}]
set_load -pin_load 0.0334 [get_ports {la_iena[61]}]
set_load -pin_load 0.0334 [get_ports {la_iena[60]}]
set_load -pin_load 0.0334 [get_ports {la_iena[59]}]
set_load -pin_load 0.0334 [get_ports {la_iena[58]}]
set_load -pin_load 0.0334 [get_ports {la_iena[57]}]
set_load -pin_load 0.0334 [get_ports {la_iena[56]}]
set_load -pin_load 0.0334 [get_ports {la_iena[55]}]
set_load -pin_load 0.0334 [get_ports {la_iena[54]}]
set_load -pin_load 0.0334 [get_ports {la_iena[53]}]
set_load -pin_load 0.0334 [get_ports {la_iena[52]}]
set_load -pin_load 0.0334 [get_ports {la_iena[51]}]
set_load -pin_load 0.0334 [get_ports {la_iena[50]}]
set_load -pin_load 0.0334 [get_ports {la_iena[49]}]
set_load -pin_load 0.0334 [get_ports {la_iena[48]}]
set_load -pin_load 0.0334 [get_ports {la_iena[47]}]
set_load -pin_load 0.0334 [get_ports {la_iena[46]}]
set_load -pin_load 0.0334 [get_ports {la_iena[45]}]
set_load -pin_load 0.0334 [get_ports {la_iena[44]}]
set_load -pin_load 0.0334 [get_ports {la_iena[43]}]
set_load -pin_load 0.0334 [get_ports {la_iena[42]}]
set_load -pin_load 0.0334 [get_ports {la_iena[41]}]
set_load -pin_load 0.0334 [get_ports {la_iena[40]}]
set_load -pin_load 0.0334 [get_ports {la_iena[39]}]
set_load -pin_load 0.0334 [get_ports {la_iena[38]}]
set_load -pin_load 0.0334 [get_ports {la_iena[37]}]
set_load -pin_load 0.0334 [get_ports {la_iena[36]}]
set_load -pin_load 0.0334 [get_ports {la_iena[35]}]
set_load -pin_load 0.0334 [get_ports {la_iena[34]}]
set_load -pin_load 0.0334 [get_ports {la_iena[33]}]
set_load -pin_load 0.0334 [get_ports {la_iena[32]}]
set_load -pin_load 0.0334 [get_ports {la_iena[31]}]
set_load -pin_load 0.0334 [get_ports {la_iena[30]}]
set_load -pin_load 0.0334 [get_ports {la_iena[29]}]
set_load -pin_load 0.0334 [get_ports {la_iena[28]}]
set_load -pin_load 0.0334 [get_ports {la_iena[27]}]
set_load -pin_load 0.0334 [get_ports {la_iena[26]}]
set_load -pin_load 0.0334 [get_ports {la_iena[25]}]
set_load -pin_load 0.0334 [get_ports {la_iena[24]}]
set_load -pin_load 0.0334 [get_ports {la_iena[23]}]
set_load -pin_load 0.0334 [get_ports {la_iena[22]}]
set_load -pin_load 0.0334 [get_ports {la_iena[21]}]
set_load -pin_load 0.0334 [get_ports {la_iena[20]}]
set_load -pin_load 0.0334 [get_ports {la_iena[19]}]
set_load -pin_load 0.0334 [get_ports {la_iena[18]}]
set_load -pin_load 0.0334 [get_ports {la_iena[17]}]
set_load -pin_load 0.0334 [get_ports {la_iena[16]}]
set_load -pin_load 0.0334 [get_ports {la_iena[15]}]
set_load -pin_load 0.0334 [get_ports {la_iena[14]}]
set_load -pin_load 0.0334 [get_ports {la_iena[13]}]
set_load -pin_load 0.0334 [get_ports {la_iena[12]}]
set_load -pin_load 0.0334 [get_ports {la_iena[11]}]
set_load -pin_load 0.0334 [get_ports {la_iena[10]}]
set_load -pin_load 0.0334 [get_ports {la_iena[9]}]
set_load -pin_load 0.0334 [get_ports {la_iena[8]}]
set_load -pin_load 0.0334 [get_ports {la_iena[7]}]
set_load -pin_load 0.0334 [get_ports {la_iena[6]}]
set_load -pin_load 0.0334 [get_ports {la_iena[5]}]
set_load -pin_load 0.0334 [get_ports {la_iena[4]}]
set_load -pin_load 0.0334 [get_ports {la_iena[3]}]
set_load -pin_load 0.0334 [get_ports {la_iena[2]}]
set_load -pin_load 0.0334 [get_ports {la_iena[1]}]
set_load -pin_load 0.0334 [get_ports {la_iena[0]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[127]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[126]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[125]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[124]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[123]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[122]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[121]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[120]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[119]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[118]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[117]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[116]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[115]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[114]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[113]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[112]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[111]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[110]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[109]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[108]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[107]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[106]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[105]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[104]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[103]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[102]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[101]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[100]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[99]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[98]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[97]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[96]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[95]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[94]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[93]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[92]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[91]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[90]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[89]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[88]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[87]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[86]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[85]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[84]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[83]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[82]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[81]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[80]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[79]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[78]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[77]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[76]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[75]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[74]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[73]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[72]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[71]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[70]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[69]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[68]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[67]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[66]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[65]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[64]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[63]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[62]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[61]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[60]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[59]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[58]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[57]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[56]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[55]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[54]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[53]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[52]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[51]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[50]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[49]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[48]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[47]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[46]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[45]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[44]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[43]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[42]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[41]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[40]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[39]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[38]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[37]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[36]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[35]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[34]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[33]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[32]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[31]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[30]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[29]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[28]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[27]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[26]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[25]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[24]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[23]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[22]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[21]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[20]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[19]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[18]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[17]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[16]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[15]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[14]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[13]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[12]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[11]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[10]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[9]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[8]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[7]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[6]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[5]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[4]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[3]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[2]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[1]}]
set_load -pin_load 0.0334 [get_ports {la_oenb[0]}]
set_load -pin_load 0.0334 [get_ports {la_output[127]}]
set_load -pin_load 0.0334 [get_ports {la_output[126]}]
set_load -pin_load 0.0334 [get_ports {la_output[125]}]
set_load -pin_load 0.0334 [get_ports {la_output[124]}]
set_load -pin_load 0.0334 [get_ports {la_output[123]}]
set_load -pin_load 0.0334 [get_ports {la_output[122]}]
set_load -pin_load 0.0334 [get_ports {la_output[121]}]
set_load -pin_load 0.0334 [get_ports {la_output[120]}]
set_load -pin_load 0.0334 [get_ports {la_output[119]}]
set_load -pin_load 0.0334 [get_ports {la_output[118]}]
set_load -pin_load 0.0334 [get_ports {la_output[117]}]
set_load -pin_load 0.0334 [get_ports {la_output[116]}]
set_load -pin_load 0.0334 [get_ports {la_output[115]}]
set_load -pin_load 0.0334 [get_ports {la_output[114]}]
set_load -pin_load 0.0334 [get_ports {la_output[113]}]
set_load -pin_load 0.0334 [get_ports {la_output[112]}]
set_load -pin_load 0.0334 [get_ports {la_output[111]}]
set_load -pin_load 0.0334 [get_ports {la_output[110]}]
set_load -pin_load 0.0334 [get_ports {la_output[109]}]
set_load -pin_load 0.0334 [get_ports {la_output[108]}]
set_load -pin_load 0.0334 [get_ports {la_output[107]}]
set_load -pin_load 0.0334 [get_ports {la_output[106]}]
set_load -pin_load 0.0334 [get_ports {la_output[105]}]
set_load -pin_load 0.0334 [get_ports {la_output[104]}]
set_load -pin_load 0.0334 [get_ports {la_output[103]}]
set_load -pin_load 0.0334 [get_ports {la_output[102]}]
set_load -pin_load 0.0334 [get_ports {la_output[101]}]
set_load -pin_load 0.0334 [get_ports {la_output[100]}]
set_load -pin_load 0.0334 [get_ports {la_output[99]}]
set_load -pin_load 0.0334 [get_ports {la_output[98]}]
set_load -pin_load 0.0334 [get_ports {la_output[97]}]
set_load -pin_load 0.0334 [get_ports {la_output[96]}]
set_load -pin_load 0.0334 [get_ports {la_output[95]}]
set_load -pin_load 0.0334 [get_ports {la_output[94]}]
set_load -pin_load 0.0334 [get_ports {la_output[93]}]
set_load -pin_load 0.0334 [get_ports {la_output[92]}]
set_load -pin_load 0.0334 [get_ports {la_output[91]}]
set_load -pin_load 0.0334 [get_ports {la_output[90]}]
set_load -pin_load 0.0334 [get_ports {la_output[89]}]
set_load -pin_load 0.0334 [get_ports {la_output[88]}]
set_load -pin_load 0.0334 [get_ports {la_output[87]}]
set_load -pin_load 0.0334 [get_ports {la_output[86]}]
set_load -pin_load 0.0334 [get_ports {la_output[85]}]
set_load -pin_load 0.0334 [get_ports {la_output[84]}]
set_load -pin_load 0.0334 [get_ports {la_output[83]}]
set_load -pin_load 0.0334 [get_ports {la_output[82]}]
set_load -pin_load 0.0334 [get_ports {la_output[81]}]
set_load -pin_load 0.0334 [get_ports {la_output[80]}]
set_load -pin_load 0.0334 [get_ports {la_output[79]}]
set_load -pin_load 0.0334 [get_ports {la_output[78]}]
set_load -pin_load 0.0334 [get_ports {la_output[77]}]
set_load -pin_load 0.0334 [get_ports {la_output[76]}]
set_load -pin_load 0.0334 [get_ports {la_output[75]}]
set_load -pin_load 0.0334 [get_ports {la_output[74]}]
set_load -pin_load 0.0334 [get_ports {la_output[73]}]
set_load -pin_load 0.0334 [get_ports {la_output[72]}]
set_load -pin_load 0.0334 [get_ports {la_output[71]}]
set_load -pin_load 0.0334 [get_ports {la_output[70]}]
set_load -pin_load 0.0334 [get_ports {la_output[69]}]
set_load -pin_load 0.0334 [get_ports {la_output[68]}]
set_load -pin_load 0.0334 [get_ports {la_output[67]}]
set_load -pin_load 0.0334 [get_ports {la_output[66]}]
set_load -pin_load 0.0334 [get_ports {la_output[65]}]
set_load -pin_load 0.0334 [get_ports {la_output[64]}]
set_load -pin_load 0.0334 [get_ports {la_output[63]}]
set_load -pin_load 0.0334 [get_ports {la_output[62]}]
set_load -pin_load 0.0334 [get_ports {la_output[61]}]
set_load -pin_load 0.0334 [get_ports {la_output[60]}]
set_load -pin_load 0.0334 [get_ports {la_output[59]}]
set_load -pin_load 0.0334 [get_ports {la_output[58]}]
set_load -pin_load 0.0334 [get_ports {la_output[57]}]
set_load -pin_load 0.0334 [get_ports {la_output[56]}]
set_load -pin_load 0.0334 [get_ports {la_output[55]}]
set_load -pin_load 0.0334 [get_ports {la_output[54]}]
set_load -pin_load 0.0334 [get_ports {la_output[53]}]
set_load -pin_load 0.0334 [get_ports {la_output[52]}]
set_load -pin_load 0.0334 [get_ports {la_output[51]}]
set_load -pin_load 0.0334 [get_ports {la_output[50]}]
set_load -pin_load 0.0334 [get_ports {la_output[49]}]
set_load -pin_load 0.0334 [get_ports {la_output[48]}]
set_load -pin_load 0.0334 [get_ports {la_output[47]}]
set_load -pin_load 0.0334 [get_ports {la_output[46]}]
set_load -pin_load 0.0334 [get_ports {la_output[45]}]
set_load -pin_load 0.0334 [get_ports {la_output[44]}]
set_load -pin_load 0.0334 [get_ports {la_output[43]}]
set_load -pin_load 0.0334 [get_ports {la_output[42]}]
set_load -pin_load 0.0334 [get_ports {la_output[41]}]
set_load -pin_load 0.0334 [get_ports {la_output[40]}]
set_load -pin_load 0.0334 [get_ports {la_output[39]}]
set_load -pin_load 0.0334 [get_ports {la_output[38]}]
set_load -pin_load 0.0334 [get_ports {la_output[37]}]
set_load -pin_load 0.0334 [get_ports {la_output[36]}]
set_load -pin_load 0.0334 [get_ports {la_output[35]}]
set_load -pin_load 0.0334 [get_ports {la_output[34]}]
set_load -pin_load 0.0334 [get_ports {la_output[33]}]
set_load -pin_load 0.0334 [get_ports {la_output[32]}]
set_load -pin_load 0.0334 [get_ports {la_output[31]}]
set_load -pin_load 0.0334 [get_ports {la_output[30]}]
set_load -pin_load 0.0334 [get_ports {la_output[29]}]
set_load -pin_load 0.0334 [get_ports {la_output[28]}]
set_load -pin_load 0.0334 [get_ports {la_output[27]}]
set_load -pin_load 0.0334 [get_ports {la_output[26]}]
set_load -pin_load 0.0334 [get_ports {la_output[25]}]
set_load -pin_load 0.0334 [get_ports {la_output[24]}]
set_load -pin_load 0.0334 [get_ports {la_output[23]}]
set_load -pin_load 0.0334 [get_ports {la_output[22]}]
set_load -pin_load 0.0334 [get_ports {la_output[21]}]
set_load -pin_load 0.0334 [get_ports {la_output[20]}]
set_load -pin_load 0.0334 [get_ports {la_output[19]}]
set_load -pin_load 0.0334 [get_ports {la_output[18]}]
set_load -pin_load 0.0334 [get_ports {la_output[17]}]
set_load -pin_load 0.0334 [get_ports {la_output[16]}]
set_load -pin_load 0.0334 [get_ports {la_output[15]}]
set_load -pin_load 0.0334 [get_ports {la_output[14]}]
set_load -pin_load 0.0334 [get_ports {la_output[13]}]
set_load -pin_load 0.0334 [get_ports {la_output[12]}]
set_load -pin_load 0.0334 [get_ports {la_output[11]}]
set_load -pin_load 0.0334 [get_ports {la_output[10]}]
set_load -pin_load 0.0334 [get_ports {la_output[9]}]
set_load -pin_load 0.0334 [get_ports {la_output[8]}]
set_load -pin_load 0.0334 [get_ports {la_output[7]}]
set_load -pin_load 0.0334 [get_ports {la_output[6]}]
set_load -pin_load 0.0334 [get_ports {la_output[5]}]
set_load -pin_load 0.0334 [get_ports {la_output[4]}]
set_load -pin_load 0.0334 [get_ports {la_output[3]}]
set_load -pin_load 0.0334 [get_ports {la_output[2]}]
set_load -pin_load 0.0334 [get_ports {la_output[1]}]
set_load -pin_load 0.0334 [get_ports {la_output[0]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[31]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[30]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[29]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[28]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[27]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[26]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[25]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[24]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[23]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[22]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[21]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[20]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[19]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[18]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[17]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[16]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[15]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[14]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[13]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[12]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[11]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[10]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[9]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[8]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[7]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[6]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[5]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[4]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[3]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[2]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[1]}]
set_load -pin_load 0.0334 [get_ports {mprj_adr_o[0]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[31]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[30]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[29]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[28]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[27]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[26]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[25]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[24]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[23]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[22]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[21]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[20]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[19]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[18]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[17]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[16]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[15]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[14]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[13]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[12]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[11]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[10]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[9]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[8]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[7]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[6]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[5]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[4]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[3]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[2]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[1]}]
set_load -pin_load 0.0334 [get_ports {mprj_dat_o[0]}]
set_load -pin_load 0.0334 [get_ports {mprj_sel_o[3]}]
set_load -pin_load 0.0334 [get_ports {mprj_sel_o[2]}]
set_load -pin_load 0.0334 [get_ports {mprj_sel_o[1]}]
set_load -pin_load 0.0334 [get_ports {mprj_sel_o[0]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[31]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[30]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[29]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[28]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[27]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[26]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[25]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[24]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[23]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[22]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[21]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[20]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[19]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[18]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[17]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[16]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[15]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[14]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[13]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[12]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[11]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[10]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[9]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[8]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[7]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[6]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[5]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[4]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[3]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[2]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[1]}]
set_load -pin_load 0.0334 [get_ports {sram_ro_data[0]}]
set_load -pin_load 0.0334 [get_ports {user_irq_ena[2]}]
set_load -pin_load 0.0334 [get_ports {user_irq_ena[1]}]
set_load -pin_load 0.0334 [get_ports {user_irq_ena[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core_rstn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io0_di}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io1_di}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io2_di}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io3_di}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in_pad}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_ack_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_ack_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ser_rx}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_sdi}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_csb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[127]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[126]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[125]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[124]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[123]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[122]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[121]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[120]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[119]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[118]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[117]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[116]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[115]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[114]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[113]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[112]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[111]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[110]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[109]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[108]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[107]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[106]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[105]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[104]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[103]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[102]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[101]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[100]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[99]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[98]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[97]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[96]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[95]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[94]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[93]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[92]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[91]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[90]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[89]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[88]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[87]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[86]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[85]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[84]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[83]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[82]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[81]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[80]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[79]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[78]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[77]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[76]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[75]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[74]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[73]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[72]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[71]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[70]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[69]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[68]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[67]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[66]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[65]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[64]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_ro_addr[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 6.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: core_clk (clock source 'core_clk')
Endpoint: DFFRAM_0/CLK (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.47    0.42   12.92 v core_clk (in)
     2    0.21                           core_clk (net)
                  0.50    0.00   12.92 v DFFRAM_0/CLK (DFFRAM)
                                 12.92   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock core_clk
No launch/capture paths found.

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
                           0.0%       0.0%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 1887000 u^2 93% utilization.
area_report_end
